Revit 2026 API

# FlexPipeIsFlexPipeTypeId Method

---

Checks if given type is valid flexible pipe type.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsFlexPipeTypeId(
	Document document,
	ElementId pipeTypeId
)
```
```vb
Public Shared Function IsFlexPipeTypeId (
	document As Document,
	pipeTypeId As ElementId
) As Boolean
```
```cpp
public:
static bool IsFlexPipeTypeId(
	Document^ document,
	ElementId^ pipeTypeId
)
```
```fsharp
static member IsFlexPipeTypeId :
        document : Document *
        pipeTypeId : ElementId -> bool
```

#### Parameters

document Document
     The document.
pipeTypeId ElementId
     ElementId of the flexible pipe type to check.

#### Return Value

Boolean True if flexible pipe type can used for this pipe, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A type is valid for flexible pipe if it can be used to the flexible pipe element.

#### Reference

FlexPipe Class

Autodesk.Revit.DB.Plumbing Namespace